; domain
(define (domain NUT-ASSEMBLY)
  (:requirements :strips :typing)

  ;; Types
  (:types nut peg robot location)

  ;; Predicates
  (:predicates
    ;; State of the world
    (at ?n - nut ?loc - location)            ;; nut is at a location table or peg)
    (grasped ?r - robot ?n - nut)            ;; robot is grasping the nut
    (on_peg ?n - nut ?p - peg)               ;; nut is on a peg
    (assembled ?n - nut)                     ;; nut has been successfully assembled
    (free ?p - peg)                          ;; peg is available for use
    (handempty ?r - robot)                   ;; robot is not holding anything

    ;; Nut and peg types
    (is_hex ?n - nut)                        ;; nut is hex type
    (is_square ?n - nut)                     ;; nut is square type
    (is_circular ?p - peg)                   ;; peg is circular type
    (is_square_peg ?p - peg)                 ;; peg is square 
  )

  ;; Actions

  ;; Pick action
  (:action pick
    :parameters (?r - robot ?n - nut ?loc - location)
    :precondition (and (at ?n ?loc) (handempty ?r))
    :effect (and 
      (not (at ?n ?loc))
      (grasped ?r ?n)
      (not (handempty ?r))
    )
  )

  ;; Place the hex nut onto a circular peg
  (:action place_on_peg_hex
    :parameters (?r - robot ?n - nut ?p - peg)
    :precondition (and 
        (grasped ?r ?n)
        (free ?p)
        (is_hex ?n)
        (is_circular ?p)
    )
    :effect (and
        (on_peg ?n ?p)
        (assembled ?n)
        (not (grasped ?r ?n))
        (handempty ?r)
        (not (free ?p))
    )
  )

  ;;place the squared nut onto a square peg
  (:action place_on_peg_square
    :parameters (?r - robot ?n - nut ?p - peg)
    :precondition (and 
        (grasped ?r ?n)
        (free ?p)
        (is_square ?n)
        (is_square_peg ?p)
    )
    :effect (and
        (on_peg ?n ?p)
        (assembled ?n)
        (not (grasped ?r ?n))
        (handempty ?r)
        (not (free ?p))
    )
  )

)

; problem
(define (problem nut-assembly-problem)
  (:domain NUT-ASSEMBLY)

  (:objects
    ;; Objects by type
    robot1 - robot
    hexnut1 squarenut1 - nut
    peg1 peg2 - peg
    table - location
  )

  (:init
    ;; Nut initial positions
    (at hexnut1 table)
    (at squarenut1 table)

    ;; Pegs are free
    (free peg1)
    (free peg2)

    ;; Robot is not holding anything
    (handempty robot1)

    ;; Nut types
    (is_hex hexnut1)
    (is_square squarenut1)

    ;; Peg types
    (is_circular peg1)
    (is_square_peg peg2)
  )

  (:goal
    (and
      (assembled hexnut1)
      (assembled squarenut1)
    )
  )
)

; plan
1. (pick robot1 hexnut1 table)
   deleted: (at hexnut1 table) (handempty robot1)
   added: (grasped robot1 hexnut1)
   goals met: 0 of 2
2. (place_on_peg_hex robot1 hexnut1 peg1)
   deleted: (grasped robot1 hexnut1) (free peg1)
   added: (on_peg hexnut1 peg1) (assembled hexnut1) (handempty robot1)
   goals met: 1 of 2
3. (pick robot1 squarenut1 table)
   deleted: (at squarenut1 table) (handempty robot1)
   added: (grasped robot1 squarenut1)
   goals met: 1 of 2
4. (place_on_peg_square robot1 squarenut1 peg2)
   deleted: (grasped robot1 squarenut1) (free peg2)
   added: (on_peg squarenut1 peg2) (assembled squarenut1) (handempty robot1)
   goals met: 2 of 2
